app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2017-06-10 18:26:23.847791"], ["updated_at", "2017-06-10 18:26:23.847791"]]
---
  def create
    # binding.pry
    Post.create(title: params[:post][:title], description: params[:post][:description])